"This announcement aggregates several security patches/updates created by WSO2 up to August 2018. \n\nKindly refer the Security Advisories section below to find separate advisories in Portable Document Format (PDF) for different products and their versions. \n\nEach advisory contains the description of the vulnerability, its impact, and the mitigation solution. Follow the instructions given in them to secure your deployment against those vulnerabilities.\n\nKindly make sure to apply the relevant patches as quickly as possible if you are using any of the listed products.\n\nThis announcement is a system generated message and therefore please do not reply to the JIRA. Please contact [mailto:security@wso2.com] if you have any concern regarding the advisories.\n\nh2.Security Advisories\n{panel}\n*WSO2-2017-0270: Multiple WSO2 Products*\nWSO2 Server returns a stack trace when an OAuth client sends a broken header in Token request.\nSeverity: Low\n[Download here|https://support.wso2.com/patches/Security%20Patches/Security%20Announcement/2018/August/WSO2-2017-0270.pdf]\n\n*WSO2-2017-0280:  Multiple WSO2 Products*\nA potential Reflected Cross-Site Scripting (XSS) vulnerability has been identified in the Management Console.\nSeverity: Medium\n[Download here|https://support.wso2.com/patches/Security%20Patches/Security%20Announcement/2018/August/WSO2-2017-0280.pdf]\n\n*WSO2-2017-0313:  WSO2 Enterprise Service Bus 4.9.0*\nA potential Reflected Cross-Site Scripting (XSS) vulnerability has been identified in the Management Console.\nSeverity: Low\n[Download here|https://support.wso2.com/patches/Security%20Patches/Security%20Announcement/2018/August/WSO2-2017-0313.pdf]\n\n*WSO2-2017-0328:  WSO2 API Manager*\nInsecure file upload for API documents and tenant themes, and potential sensitive information disclosure through error messages\nSeverity: Low\n[Download here|https://support.wso2.com/patches/Security%20Patches/Security%20Announcement/2018/August/WSO2-2017-0328.pdf]\n\n*WSO2-2018-0295: WSO2 Enterprise Integrator, WSO2 Message Broker*\nA potential Cross-site Scripting (XSS) vulnerability has been identified in the Message Broker profile.\nSeverity: Medium\n[Download here|https://support.wso2.com/patches/Security%20Patches/Security%20Announcement/2018/August/WSO2-2018-0295.pdf]\n\n*WSO2-2018-0458: Multiple WSO2 Products*\nA potential reflected Cross-Site Scripting (XSS) vulnerability has been identified in the OpenID feature.\nSeverity: Medium\n[Download here|https://support.wso2.com/patches/Security%20Patches/Security%20Announcement/2018/August/WSO2-2018-0458.pdf]\n{panel}\nWe have already tested the patches of each security advisory in-house. However, we strongly recommend you to test the patches in your development/test environments before applying in the production setups.\n\nThanks,\nWSO2 Team."
